# ─── CLI Tools (macOS + Linuxbrew) ────────────────────────
brew "stow"           # Dotfiles symlink manager
brew "neovim"         # Editor
brew "tmux"           # Terminal multiplexer
brew "bat"            # cat replacement
brew "fd"             # find replacement
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # grep replacement
brew "eza"            # ls replacement
brew "zoxide"         # cd replacement
brew "yazi"           # Terminal file manager
brew "lazygit"        # Git TUI
brew "jq"             # JSON processor
brew "gh"             # GitHub CLI
brew "glab"           # GitLab CLI
brew "asdf"           # Version manager

# ─── macOS only ──────────────────────────────────────────
if OS.mac?
  cask "font-jetbrains-mono-nerd-font"
  cask "karabiner-elements"
  cask "wezterm"
end
